In [1]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School", "Wilson High School", "Wright High School"]

for school in high_schools:
    print (school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [2]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

for school, Type in high_school_types:
    print(school,Type)

High School Type
High School Type
High School Type
High School Type

In [3]:
print(high_school_types)

[{'High School': 'Griffin', 'Type': 'District'}, {'High School': 'Figueroa', 'Type': 'District'}, {'High School': 'Wilson', 'Type': 'Charter'}, {'High School': 'Wright', 'Type': 'Charter'}]

In [6]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [7]:
# Add Pandas dependency 
import pandas as pd

In [8]:
# Create a Pandas Series from a list 
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [9]:
school_series[0:14]

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
dtype: object

In [10]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [11]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [12]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [13]:
#Initailize a new DataFrame
schools_df = pd.DataFrame()

In [14]:
# Add the list to a new DataFrame
schools_df["School ID"] = school_id
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [16]:
# Add the other lists to Schools_df Dataframe
schools_df["School Name"] = school_name
schools_df["Type"] = type_of_school
schools_df

   School ID            School Name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [17]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [18]:
high_schools_df = pd.DataFrame(high_schools_dict)
high_schools_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [19]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [20]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [21]:
school_df.values

array([[0, 'Huang High    School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [28]:
# Create three seperate lists
id_two = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]
name = ['Huang', 'Figueroa', 'Shelton', 'Hernan', 'Griffein', 'Wilson', 'Cabera', 'Bailey', 'Holden', 'Pena', 'Wringt', 'Rod', 'John', 'Ford', 'Thomas']
tyype = ['d','d','c','d','c','c','d','d','c','d','c','c','c','c']

In [30]:
id_two

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [31]:
name

['Huang',
 'Figueroa',
 'Shelton',
 'Hernan',
 'Griffein',
 'Wilson',
 'Cabera',
 'Bailey',
 'Holden',
 'Pena',
 'Wringt',
 'Rod',
 'John',
 'Ford',
 'Thomas']

In [32]:
tyype

['d', 'd', 'c', 'd', 'c', 'c', 'd', 'd', 'c', 'd', 'c', 'c', 'c', 'c']

In [34]:
new_df= pd.DataFrame()

In [35]:
new_df["id"] = id_two

In [36]:
new_df

    id
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10
11  11
12  12
13  13
14  14

In [37]:
new_df["name"] = name

In [38]:
new_df

    id      name
0    0     Huang
1    1  Figueroa
2    2   Shelton
3    3    Hernan
4    4  Griffein
5    5    Wilson
6    6    Cabera
7    7    Bailey
8    8    Holden
9    9      Pena
10  10    Wringt
11  11       Rod
12  12      John
13  13      Ford
14  14    Thomas

In [40]:
tyype.append("c")

In [41]:
tyype

['d', 'd', 'c', 'd', 'c', 'c', 'd', 'd', 'c', 'd', 'c', 'c', 'c', 'c', 'c']

In [42]:
len(tyype)

15

In [43]:
new_df["type"] = tyype

In [44]:
new_df

    id      name type
0    0     Huang    d
1    1  Figueroa    d
2    2   Shelton    c
3    3    Hernan    d
4    4  Griffein    c
5    5    Wilson    c
6    6    Cabera    d
7    7    Bailey    d
8    8    Holden    c
9    9      Pena    d
10  10    Wringt    c
11  11       Rod    c
12  12      John    c
13  13      Ford    c
14  14    Thomas    c